raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_adc.c
/****************************************************************************
 * arch/arm/src/nrf54l/nrf54l_adc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <string.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>
#include <arch/barriers.h>

#include "arm_internal.h"
#include "nrf54l_adc.h"

#include "hardware/nrf54l_saadc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct nrf54l_adc_s
{
  /* Upper-half callback */

  const struct adc_callback_s *cb;

  /* Channels configuration */

  struct nrf54l_adc_channel_s channels[CONFIG_NRF54L_SAADC_CHANNELS];

  /* Samples buffer */

  int16_t                    buffer[CONFIG_NRF54L_SAADC_CHANNELS]
                             aligned_data(4);
  int16_t                    calibration[2] aligned_data(4);

  uint8_t                    chan_len;   /* Configured channels */
  uint32_t                   base;       /* Base address of ADC register */
  uint32_t                   irq;        /* ADC interrupt */
  bool                       opened;     /* Device is configured */
  bool                       busy;       /* Conversion in progress */
  bool                       rxenabled;  /* Deliver samples */
  uint16_t                   remaining;  /* Software oversamples left */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* ADC Register access */

static inline void nrf54l_adc_putreg(struct nrf54l_adc_s *priv,
                                    uint32_t offset,
                                    uint32_t value);
static inline uint32_t nrf54l_adc_getreg(struct nrf54l_adc_s *priv,
                                        uint32_t offset);

/* ADC helpers */

static int nrf54l_adc_configure(struct nrf54l_adc_s *priv);
static int nrf54l_adc_calibrate(struct nrf54l_adc_s *priv);
static void nrf54l_adc_stop(struct nrf54l_adc_s *priv);
static uint32_t nrf54l_adc_ch_config(const struct nrf54l_adc_channel_s *cfg);
static uint32_t nrf54l_adc_chanpsel(int psel);
static int nrf54l_adc_chancfg(struct nrf54l_adc_s *priv, uint8_t chan,
                             struct nrf54l_adc_channel_s *cfg);
static int nrf54l_adc_isr(int irq, void *context, void *arg);

/* ADC Driver Methods */

static int  nrf54l_adc_bind(struct adc_dev_s *dev,
                           const struct adc_callback_s *callback);
static void nrf54l_adc_reset(struct adc_dev_s *dev);
static int  nrf54l_adc_setup(struct adc_dev_s *dev);
static void nrf54l_adc_shutdown(struct adc_dev_s *dev);
static void nrf54l_adc_rxint(struct adc_dev_s *dev, bool enable);
static int  nrf54l_adc_ioctl(struct adc_dev_s *dev, int cmd,
                            unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ADC interface operations */

static const struct adc_ops_s g_nrf54l_adcops =
{
  .ao_bind        = nrf54l_adc_bind,
  .ao_reset       = nrf54l_adc_reset,
  .ao_setup       = nrf54l_adc_setup,
  .ao_shutdown    = nrf54l_adc_shutdown,
  .ao_rxint       = nrf54l_adc_rxint,
  .ao_ioctl       = nrf54l_adc_ioctl,
};

/* SAADC device */

static struct nrf54l_adc_s g_nrf54l_adcpriv =
{
  .cb         = NULL,
  .base       = NRF54L_SAADC_BASE,
  .irq        = NRF54L_IRQ_SAADC,
};

/* Upper-half ADC device */

static struct adc_dev_s g_nrf54l_adc =
{
  .ad_ops      = &g_nrf54l_adcops,
  .ad_priv     = &g_nrf54l_adcpriv,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf54l_adc_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void nrf54l_adc_putreg(struct nrf54l_adc_s *priv,
                                    uint32_t offset,
                                    uint32_t value)
{
  DEBUGASSERT(priv);

  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: nrf54l_adc_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t nrf54l_adc_getreg(struct nrf54l_adc_s *priv,
                                        uint32_t offset)
{
  DEBUGASSERT(priv);

  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: nrf54l_adc_isr
 *
 * Description:
 *   Common ADC interrupt service routine
 *
 ****************************************************************************/

