raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_adc.c
static int nrf54l_adc_isr(int irq, void *context, void *arg)
{
  struct adc_dev_s    *dev  = (struct adc_dev_s *) arg;
  struct nrf54l_adc_s *priv = NULL;
  int                 i    = 0;

  DEBUGASSERT(dev);

  priv = (struct nrf54l_adc_s *) dev->ad_priv;
  DEBUGASSERT(priv);

  ainfo("nrf54l_adc_isr\n");

  /* END event */

  if (nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET) == 1)
    {
      nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET, 0);
      nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET);

      /* Stop the local timer and release DMA before reporting samples. */

      nrf54l_adc_stop(priv);
      nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET, 0);
      nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_DONE_OFFSET, 0);
      nrf54l_adc_putreg(priv, NRF54L_SAADC_INTENCLR_OFFSET, SAADC_INT_DONE);
      nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET);
      UP_DMB();

      /* Give the ADC data to the ADC driver */

      if (priv->busy && priv->rxenabled && priv->cb != NULL &&
          nrf54l_adc_getreg(priv, NRF54L_SAADC_AMOUNT_OFFSET) ==
          priv->chan_len * sizeof(int16_t))
        {
          for (i = 0; i < priv->chan_len; i += 1)
            {
              priv->cb->au_receive(dev, i, priv->buffer[i]);
            }
        }

      priv->busy = false;
    }
#if defined(CONFIG_NRF54L_SAADC_TASK) && CONFIG_NRF54L_SAADC_OVERSAMPLE > 0
  else if (priv->busy && !priv->channels[0].burst &&
           nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_DONE_OFFSET) != 0)
    {
      /* Without burst, each oversample requires a separate SAMPLE task. */

      nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_DONE_OFFSET, 0);
      nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_DONE_OFFSET);
      if (priv->remaining > 0)
        {
          priv->remaining--;
          nrf54l_adc_putreg(priv, NRF54L_SAADC_TASKS_SAMPLE_OFFSET, 1);
        }
      else
        {
          nrf54l_adc_putreg(priv, NRF54L_SAADC_INTENCLR_OFFSET,
                          SAADC_INT_DONE);
        }
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: nrf54l_adc_configure
 *
 * Description:
 *   Configure ADC
 *
 ****************************************************************************/

static int nrf54l_adc_configure(struct nrf54l_adc_s *priv)
{
  uint32_t regval = 0;

  DEBUGASSERT(priv);

  /* Configure ADC resolution */

  regval = CONFIG_NRF54L_SAADC_RESOLUTION;
  nrf54l_adc_putreg(priv, NRF54L_SAADC_RESOLUTION_OFFSET, regval);

  /* Configure oversampling */

  regval = CONFIG_NRF54L_SAADC_OVERSAMPLE;
  nrf54l_adc_putreg(priv, NRF54L_SAADC_OVERSAMPLE_OFFSET, regval);

#ifndef CONFIG_ARCH_CHIP_NRF54L15
  /* LM20 has global burst control instead of a per-channel CONFIG bit. */

  regval = CONFIG_NRF54L_SAADC_OVERSAMPLE > 0 && priv->channels[0].burst ?
           SAADC_BURST_EN : SAADC_BURST_DIS;
  nrf54l_adc_putreg(priv, NRF54L_SAADC_BURST_OFFSET, regval);
#endif

  /* Configure sample rate */

#if defined(CONFIG_NRF54L_SAADC_TIMER)
  /* Trigger from local timer */

  regval = SAADC_SAMPLERATE_MODE_TIMERS;
  regval |= ((CONFIG_NRF54L_SAADC_TIMER_CC & SAADC_SAMPLERATE_CC_MASK)
             << SAADC_SAMPLERATE_CC_SHIFT);
#elif defined(CONFIG_NRF54L_SAADC_TASK)
  /* Trigger on SAMPLE task */

  regval = SAADC_SAMPLERATE_MODE_TASK;
#else
#  error SAADC trigger not selected
#endif

  nrf54l_adc_putreg(priv, NRF54L_SAADC_SAMPLERATE_OFFSET, regval);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_SHORTS_OFFSET, 0);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_NOISESHAPE_OFFSET,
                  SAADC_NOISESHAPE_DISABLE);

  /* Configure ADC buffer */

  regval = (uintptr_t)priv->buffer;
  nrf54l_adc_putreg(priv, NRF54L_SAADC_PTR_OFFSET, regval);

  regval = priv->chan_len * sizeof(int16_t);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_MAXCNT_OFFSET, regval);

  return OK;
}

/****************************************************************************
 * Name: nrf54l_adc_calibrate
 *
 * Description:
 *   Calibrate ADC
 *
 ****************************************************************************/

static int nrf54l_adc_calibrate(struct nrf54l_adc_s *priv)
{
  /* Clear Event */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_CALDONE_OFFSET, 0);

  /* Start calibration */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_TASKS_CALOFFSET_OFFSET, 1);

  /* Wait for calibration done */

  while (nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_CALDONE_OFFSET) != 1)
    {
    }

  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_CALDONE_OFFSET, 0);

  /* Latch a scratch buffer and stop to drain post-calibration results,
   * following the Nordic SAADC calibration sequence.
   */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_PTR_OFFSET,
                  (uintptr_t)priv->calibration);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_MAXCNT_OFFSET,
                  sizeof(priv->calibration));
  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_STARTED_OFFSET, 0);
  UP_DMB();
  nrf54l_adc_putreg(priv, NRF54L_SAADC_TASKS_START_OFFSET, 1);
  while (nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_STARTED_OFFSET) == 0)
    {
    }

  nrf54l_adc_stop(priv);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET, 0);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_DONE_OFFSET, 0);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_PTR_OFFSET,
                  (uintptr_t)priv->buffer);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_MAXCNT_OFFSET,
                  priv->chan_len * sizeof(int16_t));

  return OK;
}

/****************************************************************************
 * Name: nrf54l_adc_stop
 *
 * Description:
 *   Stop sampling and wait until DMA has released the result buffer.
 *
 ****************************************************************************/

static void nrf54l_adc_stop(struct nrf54l_adc_s *priv)
{
  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_STOPPED_OFFSET, 0);
  nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_STOPPED_OFFSET);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_TASKS_STOP_OFFSET, 1);
  while (nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_STOPPED_OFFSET) == 0)
    {
    }

  nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_STOPPED_OFFSET, 0);
  nrf54l_adc_getreg(priv, NRF54L_SAADC_EVENTS_STOPPED_OFFSET);
  UP_DMB();
}

/****************************************************************************
 * Name: nrf54l_adc_ch_config
 *
 * Description:
 *   Encode a validated channel configuration.
 *
 ****************************************************************************/

static uint32_t nrf54l_adc_ch_config(const struct nrf54l_adc_channel_s *cfg)
{
  uint32_t regval = 0;

  /* Gain control */

  switch (cfg->gain)
    {
      case NRF54L_ADC_GAIN_2_3:
        {
          regval |= SAADC_CONFIG_GAIN_2P3;
          break;
        }

      case NRF54L_ADC_GAIN_2_5:
        {
          regval |= SAADC_CONFIG_GAIN_2P5;
          break;
        }

      case NRF54L_ADC_GAIN_1_4:
        {
          regval |= SAADC_CONFIG_GAIN_1P4;
          break;
        }

      case NRF54L_ADC_GAIN_1_3:
        {
          regval |= SAADC_CONFIG_GAIN_1P3;
          break;
        }

      case NRF54L_ADC_GAIN_1_2:
        {
          regval |= SAADC_CONFIG_GAIN_1P2;
          break;
        }

