raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_adc.c
      case NRF54L_ADC_GAIN_1:
        {
          regval |= SAADC_CONFIG_GAIN_1;
          break;
        }

      case NRF54L_ADC_GAIN_2:
        {
          regval |= SAADC_CONFIG_GAIN_2;
          break;
        }

      case NRF54L_ADC_GAIN_2_7:
        {
          regval |= SAADC_CONFIG_GAIN_2P7;
          break;
        }

      default:
        {
          aerr("ERROR: invalid cfg->gain: %d\n", cfg->gain);
        }
    }

  /* Reference control */

  switch (cfg->refsel)
    {
      case NRF54L_ADC_REFSEL_INTERNAL:
        {
          regval |= SAADC_CONFIG_REFSEL_INTERNAL;
          break;
        }

      case NRF54L_ADC_REFSEL_EXTERNAL:
        {
          regval |= SAADC_CONFIG_REFSEL_EXTERNAL;
          break;
        }

      default:
        {
          aerr("ERROR: invalid cfg->refsel: %d\n", cfg->refsel);
        }
    }

  /* Acquisition time */

  switch (cfg->tacq)
    {
      case NRF54L_ADC_TACQ_3US:
        {
          regval |= SAADC_CONFIG_TACQ_3US;
          break;
        }

      case NRF54L_ADC_TACQ_5US:
        {
          regval |= SAADC_CONFIG_TACQ_5US;
          break;
        }

      case NRF54L_ADC_TACQ_10US:
        {
          regval |= SAADC_CONFIG_TACQ_10US;
          break;
        }

      case NRF54L_ADC_TACQ_15US:
        {
          regval |= SAADC_CONFIG_TACQ_15US;
          break;
        }

      case NRF54L_ADC_TACQ_20US:
        {
          regval |= SAADC_CONFIG_TACQ_20US;
          break;
        }

      case NRF54L_ADC_TACQ_40US:
        {
          regval |= SAADC_CONFIG_TACQ_40US;
          break;
        }

      default:
        {
          aerr("ERROR: invalid cfg->tacq: %d\n", cfg->tacq);
        }
    }

  /* Use a 2 us conversion time, as on nRF53. */

  regval |= SAADC_CONFIG_TCONV_2US;

  /* Single-ended or differential mode */

  switch (cfg->mode)
    {
      case NRF54L_ADC_MODE_SE:
        {
          regval |= SAADC_CONFIG_MODE_SE;
          break;
        }

      case NRF54L_ADC_MODE_DIFF:
        {
          regval |= SAADC_CONFIG_MODE_DIFF;
          break;
        }

      default:
        {
          aerr("ERROR: invalid cfg->mode: %d\n", cfg->mode);
        }
    }

  /* Burst mode is configured per channel on L15. */

#ifdef CONFIG_ARCH_CHIP_NRF54L15
  switch (cfg->burst)
    {
      case NRF54L_ADC_BURST_DISABLE:
        {
          regval |= SAADC_CONFIG_BURS_DIS;
          break;
        }

      case NRF54L_ADC_BURST_ENABLE:
        {
          if (CONFIG_NRF54L_SAADC_OVERSAMPLE > 0)
            {
              regval |= SAADC_CONFIG_BURS_EN;
            }

          break;
        }

      default:
        {
          aerr("ERROR: invalid cfg->burst: %d\n", cfg->burst);
        }
    }
#endif

  return regval;
}

/****************************************************************************
 * Name: nrf54l_adc_chanpsel
 *
 * Description:
 *   Convert an analog input number to the hardware pin selection.
 *
 ****************************************************************************/

static uint32_t nrf54l_adc_chanpsel(int psel)
{
  uint32_t regval = 0;

  /* AIN0 through AIN7 use different pads on L15 and LM20. */

#ifdef CONFIG_ARCH_CHIP_NRF54L15
  static const uint8_t pins[8] =
  {
    4, 5, 6, 7, 11, 12, 13, 14
  };
#else
  static const uint8_t pins[8] =
  {
    0, 31, 30, 29, 6, 5, 4, 3
  };
#endif

  if (psel >= NRF54L_ADC_IN_IN0 && psel <= NRF54L_ADC_IN_IN7)
    {
      return SAADC_CHPSEL_ANALOG | (1 << SAADC_CHPSEL_PORT_SHIFT) |
             pins[psel - NRF54L_ADC_IN_IN0];
    }

  switch (psel)
    {
      case NRF54L_ADC_IN_NC:
        {
          regval = SAADC_CHPSEL_NC;
          break;
        }

      case NRF54L_ADC_IN_VDD:
        {
          regval = SAADC_CHPSEL_INTERNAL | SAADC_CHPSEL_VDD;
          break;
        }

      case NRF54L_ADC_IN_AVDD:
        {
          regval = SAADC_CHPSEL_INTERNAL | SAADC_CHPSEL_AVDD;
          break;
        }

      case NRF54L_ADC_IN_DVDD:
        {
          regval = SAADC_CHPSEL_INTERNAL | SAADC_CHPSEL_DVDD;
          break;
        }

      default:
        {
          aerr("ERROR: invalid psel: %d\n", psel);
        }
    }

  return regval;
}

/****************************************************************************
 * Name: nrf54l_adc_chancfg
 *
 * Description:
 *   Configure ADC channel
 *
 ****************************************************************************/

static int nrf54l_adc_chancfg(struct nrf54l_adc_s *priv, uint8_t chan,
                             struct nrf54l_adc_channel_s *cfg)
{
  uint32_t regval = 0;
  int      ret    = OK;

  DEBUGASSERT(priv);

  /* Configure positive input */

  regval = nrf54l_adc_chanpsel(cfg->p_psel);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_CHPSELP_OFFSET(chan), regval);

  /* Configure negative input */

  regval = nrf54l_adc_chanpsel(cfg->n_psel);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_CHPSELN_OFFSET(chan), regval);

  /* Get channel configuration */

  regval = nrf54l_adc_ch_config(cfg);

  /* Write channel configuration */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_CHCONFIG_OFFSET(chan), regval);

#ifdef CONFIG_NRF54L_SAADC_LIMITS
  /* Configure limits */

  regval = ((uint32_t)(uint16_t)cfg->limith << SAADC_CHLIMIT_HIGH_SHIFT) |
           ((uint32_t)(uint16_t)cfg->limitl << SAADC_CHLIMIT_LOW_SHIFT);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_CHLIMIT_OFFSET(chan), regval);
#endif

  return ret;
}

/****************************************************************************
 * Name: nrf54l_adc_bind
 *
 * Description:
 *   Bind the upper-half driver callbacks to the lower-half implementation.
 *   This must be called early in order to receive ADC event notifications.
 *
 ****************************************************************************/

static int nrf54l_adc_bind(struct adc_dev_s *dev,
                          const struct adc_callback_s *callback)
{
  struct nrf54l_adc_s *priv = (struct nrf54l_adc_s *) dev->ad_priv;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);

  if (callback == NULL || callback->au_receive == NULL)
    {
      return -EINVAL;
    }

  priv->cb = callback;

  return OK;
}

/****************************************************************************
 * Name: nrf54l_adc_reset
 *
 * Description:
 *   Reset the ADC device.  Called early to initialize the hardware.
 *   This is called, before adc_setup() and on error conditions.
 *
 ****************************************************************************/

static void nrf54l_adc_reset(struct adc_dev_s *dev)
{
  struct nrf54l_adc_s *priv = (struct nrf54l_adc_s *) dev->ad_priv;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);

  if (priv->opened)
    {
      nrf54l_adc_shutdown(dev);
    }
}

/****************************************************************************
 * Name: nrf54l_adc_setup
 *
 * Description:
 *   Configure the ADC. This method is called the first time that the ADC
 *   device is opened.  This will occur when the port is first opened.
 *   This setup includes configuring and attaching ADC interrupts.
 *   Completion interrupts maintain DMA ownership. Sample delivery is
 *   enabled separately by the upper half.
 *
 ****************************************************************************/

static int nrf54l_adc_setup(struct adc_dev_s *dev)
{
  struct nrf54l_adc_s *priv = (struct nrf54l_adc_s *) dev->ad_priv;
  int                 i    = 0;
  int                 ret  = OK;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);

  if (priv->opened || priv->chan_len == 0)
    {
      return -EINVAL;
    }

  /* Disable ADC */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_INTENCLR_OFFSET, SAADC_INT_ALL);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 0);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 0);

