raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_adc.c
  for (i = 0; i < 8; i++)
    {
      nrf54l_adc_putreg(priv, NRF54L_SAADC_CHPSELP_OFFSET(i),
                      SAADC_CHPSEL_NC);
      nrf54l_adc_putreg(priv, NRF54L_SAADC_CHPSELN_OFFSET(i),
                      SAADC_CHPSEL_NC);
      nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_CHLIMH_OFFSET(i), 0);
      nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_CHLIML_OFFSET(i), 0);
    }

  /* Configure ADC */

  ret = nrf54l_adc_configure(priv);
  if (ret < 0)
    {
      aerr("ERROR: nrf54l_adc_configure failed: %d\n", ret);
      goto errout;
    }

  /* Configure ADC channels */

  for (i = 0; i < priv->chan_len; i += 1)
    {
      ret = nrf54l_adc_chancfg(priv, i, &priv->channels[i]);
      if (ret < 0)
        {
          aerr("ERROR: chancfg failed: %d %d\n", i, ret);
          goto errout;
        }
    }

  /* Enable ADC */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 1);

  /* Calibrate ADC */

  ret = nrf54l_adc_calibrate(priv);
  if (ret < 0)
    {
      aerr("ERROR: adc calibration failed: %d\n", ret);
      goto errout;
    }

  /* Attach the ADC interrupt */

  ret = irq_attach(priv->irq, nrf54l_adc_isr, dev);
  if (ret < 0)
    {
      aerr("ERROR: irq_attach failed: %d\n", ret);
      goto errout;
    }

  /* Enable the ADC interrupt */

  priv->opened = true;
  priv->busy = false;
  priv->rxenabled = false;
  nrf54l_adc_putreg(priv, NRF54L_SAADC_INTENSET_OFFSET, SAADC_INT_END);
  up_enable_irq(priv->irq);
  return OK;

errout:
  if (nrf54l_adc_getreg(priv, NRF54L_SAADC_ENABLE_OFFSET) != 0)
    {
      nrf54l_adc_stop(priv);
    }

  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 0);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 0);
  return ret;
}

/****************************************************************************
 * Name: nrf54l_adc_shutdown
 *
 * Description:
 *   Disable the ADC.  This method is called when the ADC device is closed.
 *   This method reverses the operation the setup method.
 *
 ****************************************************************************/

static void nrf54l_adc_shutdown(struct adc_dev_s *dev)
{
  struct nrf54l_adc_s *priv = (struct nrf54l_adc_s *) dev->ad_priv;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);

  if (!priv->opened)
    {
      return;
    }

  up_disable_irq(priv->irq);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_INTENCLR_OFFSET, SAADC_INT_ALL);
  nrf54l_adc_stop(priv);

  /* Anomaly 101: write ENABLE twice to fully disable the SAADC. */

  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 0);
  nrf54l_adc_putreg(priv, NRF54L_SAADC_ENABLE_OFFSET, 0);
  irq_detach(priv->irq);
  priv->busy = false;
  priv->rxenabled = false;
  priv->opened = false;
}

/****************************************************************************
 * Name: nrf54l_adc_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *
 ****************************************************************************/

static void nrf54l_adc_rxint(struct adc_dev_s *dev, bool enable)
{
  struct nrf54l_adc_s *priv   = (struct nrf54l_adc_s *) dev->ad_priv;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);

  ainfo("RXINT enable: %d\n", enable ? 1 : 0);

  priv->rxenabled = enable;
}

/****************************************************************************
 * Name: nrf54l_adc_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method.
 *
 ****************************************************************************/

static int nrf54l_adc_ioctl(struct adc_dev_s *dev, int cmd,
                           unsigned long arg)
{
  struct nrf54l_adc_s *priv = (struct nrf54l_adc_s *) dev->ad_priv;
  irqstate_t flags;
  int ret                  = OK;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);

  switch (cmd)
    {
      case ANIOC_TRIGGER:
        {
          flags = enter_critical_section();
          if (!priv->opened || priv->busy)
            {
              ret = priv->opened ? -EBUSY : -EIO;
              leave_critical_section(flags);
              break;
            }

          priv->busy = true;
          nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_STARTED_OFFSET, 0);
          nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_END_OFFSET, 0);
          nrf54l_adc_putreg(priv, NRF54L_SAADC_EVENTS_DONE_OFFSET, 0);
#if defined(CONFIG_NRF54L_SAADC_TASK) && CONFIG_NRF54L_SAADC_OVERSAMPLE > 0
          if (!priv->channels[0].burst)
            {
              priv->remaining = (1 << CONFIG_NRF54L_SAADC_OVERSAMPLE) - 1;
              nrf54l_adc_putreg(priv, NRF54L_SAADC_INTENSET_OFFSET,
                              SAADC_INT_DONE);
            }
#endif

          /* Start ADC */

          UP_DMB();
          nrf54l_adc_putreg(priv, NRF54L_SAADC_TASKS_START_OFFSET, 1);
          while (nrf54l_adc_getreg(priv,
                                 NRF54L_SAADC_EVENTS_STARTED_OFFSET) == 0)
            {
            }

          /* Trigger first sample */

          nrf54l_adc_putreg(priv, NRF54L_SAADC_TASKS_SAMPLE_OFFSET, 1);
          leave_critical_section(flags);
        }
        break;

      case ANIOC_GET_NCHANNELS:
        {
          /* Return the number of configured channels */

          ret = priv->chan_len;
        }
        break;

      default:
        {
          aerr("ERROR: Unknown cmd: %d\n", cmd);
          ret = -ENOTTY;
        }
        break;
    }

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf54l_adcinitialize
 *
 * Description:
 *   Initialize the ADC with a validated list of channel configurations.
 *
 * Input Parameters:
 *   chan     - Channel configurations
 *   channels - Number of channels
 *
 * Returned Value:
 *   Valid ADC device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

