raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_adc.c
struct adc_dev_s *nrf54l_adcinitialize(
    const struct nrf54l_adc_channel_s *chan, int channels)
{
  struct adc_dev_s    *dev  = NULL;
  struct nrf54l_adc_s *priv = NULL;
  int                 i    = 0;
  irqstate_t          flags;
#ifdef CONFIG_NRF54L_SAADC_TIMER
  uint32_t            clocks;
#endif

  if (chan == NULL || channels < 1 ||
      channels > CONFIG_NRF54L_SAADC_CHANNELS)
    {
      return NULL;
    }

#ifdef CONFIG_NRF54L_SAADC_TIMER
  if (channels > 1)
    {
      aerr("ERROR: timer trigger works only for 1 channel!\n");
      return NULL;
    }
#endif

  /* Get device */

  dev = &g_nrf54l_adc;

  /* Get private data */

  priv = (struct nrf54l_adc_s *) dev->ad_priv;

  for (i = 0; i < channels; i++)
    {
      if (chan[i].p_psel == NRF54L_ADC_IN_NC ||
          chan[i].p_psel > NRF54L_ADC_IN_DVDD ||
          chan[i].n_psel > NRF54L_ADC_IN_DVDD ||
          chan[i].tacq > NRF54L_ADC_TACQ_40US ||
          (chan[i].mode == NRF54L_ADC_MODE_DIFF &&
           chan[i].n_psel == NRF54L_ADC_IN_NC) ||
          (chan[i].mode == NRF54L_ADC_MODE_SE &&
           chan[i].n_psel != NRF54L_ADC_IN_NC))
        {
          return NULL;
        }

#if CONFIG_NRF54L_SAADC_OVERSAMPLE > 0
      if (channels > 1 && !chan[i].burst)
        {
          return NULL;
        }
#endif

#ifdef CONFIG_NRF54L_SAADC_TIMER
      /* The timer period must cover acquisition and conversion. */

      clocks = nrf54l_adc_ch_config(&chan[i]);
      clocks = ((clocks & SAADC_CONFIG_TACQ_MASK) >>
                SAADC_CONFIG_TACQ_SHIFT) + 1;
      clocks = 2 * clocks + 32;
      if (chan[i].burst)
        {
          clocks <<= CONFIG_NRF54L_SAADC_OVERSAMPLE;
        }

      if (clocks > CONFIG_NRF54L_SAADC_TIMER_CC)
        {
          return NULL;
        }
#endif

#ifdef CONFIG_NRF54L_SAADC_LIMITS
      if (chan[i].limitl > chan[i].limith)
        {
          return NULL;
        }
#endif
    }

  flags = enter_critical_section();
  if (priv->opened)
    {
      leave_critical_section(flags);
      return NULL;
    }

  /* Copy channels configuration */

  ainfo("channels: %d\n", channels);

  for (i = 0; i < channels; i += 1)
    {
      memcpy(&priv->channels[i], &chan[i],
             sizeof(struct nrf54l_adc_channel_s));
    }

  priv->chan_len = channels;
  leave_critical_section(flags);
  return dev;
}
